<template>
  <modal
    :id="'form-modal'"
    class="form-modal"
    :title="'Отклик на вакансию ' + work.name"
    :width="845"
  >
    <ClientOnly>
      <form @submit.prevent="validateSubmit">
        <p class="form-modal__subtitle">1. Заполните контактную информацию</p>

        <div class="input-box">
          <div
            :class="[
              'input-container',
              nameError ? 'input-container-error' : '',
            ]"
          >
            <input
              type="text"
              placeholder="Имя"
              name="name"
              v-model="name"
              autocomplete="off"
              required
            />

            <div class="error-icon" v-html="errorRequired(nameError)"></div>
          </div>

          <div class="input-container">
            <input
              type="text"
              placeholder="Фамилия"
              name="surname"
              v-model="surname"
              autocomplete="off"
            />
          </div>

          <div
            :class="[
              'input-container',
              phoneError ? 'input-container-error' : '',
            ]"
          >
            <input
              name="phone"
              type="text"
              v-mask="'+7 (###) ###-##-##'"
              v-model="phone"
              placeholder="Номер телефона"
              autocomplete="off"
              required
            />

            <div class="error-icon" v-html="errorRequired(phoneError)"></div>
          </div>

          <div
            :class="[
              'input-container',
              emailError ? 'input-container-error' : '',
            ]"
          >
            <input
              type="email"
              placeholder="E-mail"
              name="email"
              v-model="email"
              autocomplete="off"
            />

            <div class="error-icon" v-html="errorRequired(emailError)"></div>
          </div>
        </div>

        <p class="form-modal__subtitle">2. Выберите мессенджер для связи</p>

        <div class="messenger-box">
          <div
            v-for="(item, index) in messengers"
            :key="index"
            :class="[
              'messenger-box__item',
              item.active ? 'messenger-box__item-active' : '',
            ]"
            @click="setMessenger(index)"
            v-html="item.svg"
          ></div>
        </div>

        <p class="form-modal__subtitle">3. Прикрепите резюме</p>

        <div class="resume-box">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="12"
            height="20"
            viewBox="0 0 12 20"
            fill="none"
          >
            <path
              d="M0.773187 5.2108L0.773186 15.1939C0.773186 18.0236 2.54153 20 5.07337 20L7.02958 20C9.54107 20 11.2285 18.0686 11.2285 15.1939C11.2285 15.1939 11.2285 4.0848 11.2285 4.08101C11.2285 1.88393 9.43929 4.37126e-05 7.23186 0.00222553C7.20369 0.0016495 7.17584 4.35147e-05 7.14755 4.35122e-05C4.93118 4.33185e-05 3.12321 1.77634 3.06658 3.97977L3.06657 11.7369C3.06657 13.3633 4.29616 14.6374 5.86594 14.6374L6.16942 14.6374C7.70764 14.6374 8.86766 13.3904 8.86766 11.7369L8.86766 5.29511L7.34995 5.29511L7.34995 11.7369C7.34995 12.4252 6.98497 13.1198 6.16954 13.1198L5.86598 13.1198C5.13536 13.1198 4.58437 12.5253 4.58437 11.7369L4.58437 4.08101C4.58437 2.66768 5.73421 1.51779 7.14759 1.51779C7.90568 1.51779 8.58765 1.84887 9.05742 2.37375C9.43542 2.86296 9.71077 3.62402 9.71077 4.80611L9.71077 15.1941C9.71077 17.6186 8.32569 18.4824 7.02945 18.4824L5.07328 18.4824C3.15126 18.4824 2.29081 16.8308 2.29081 15.1941L2.29081 5.21092L0.773023 5.21092L0.773023 5.21084L0.773187 5.21084L0.773187 5.2108Z"
              fill="#323232"
            />
          </svg>

          <p>{{ fileName }}</p>

          <input
            v-on:change="onFileChange"
            name="file"
            type="file"
            accept=".doc, .docx, .pdf"
            v-tabindex
            placeholder="Прикрепить файл"
            :multiple="false"
            :disabled="false"
            title="Прикрепить резюме"
            class="file-input"
          />
        </div>

        <button
          :class="['button-primary', loading ? 'skeleton-image' : '']"
          :disabled="loading"
          type="submit"
        >
          <span>Отправить</span>
        </button>

        <p class="policy">
          Нажимая кнопку «Отправить», я даю согласие на обработку
          <NuxtLink :to="'/pravovaja-informacija'">
            персональных данных</NuxtLink
          >
        </p>
      </form>
    </ClientOnly>
  </modal>
</template>

<script lang="ts" setup>
import type { IVakansiiContent } from "~/config/sotrudnichestvo";
import Modal from "../UI/Modal.vue";

const props = defineProps<{
  work: IVakansiiContent;
}>();

const loading = ref(false);
const errorSubmit = ref(false);

const mailText = "почта mail";

// input-box
const name = ref("");
const phone = ref("");
const email = ref("");
const surname = ref("");

const nameError = computed(() => {
  return name.value.length < 2 && errorSubmit.value;
});
const phoneError = computed(() => {
  return phone.value.length < 18 && errorSubmit.value;
});
const emailError = computed(() => {
  return (
    email.value.length < 8 &&
    messengers.value.find((el) => el.name == mailText)!.active &&
    errorSubmit.value
  );
});

const errorRequired = (bool: boolean) => {
  return bool
    ? `
  <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
    <circle cx="7.5" cy="7.5" r="6.9" fill="#FF0000" stroke="#FF0000" stroke-width="1.2"/>
    <path d="M8.60412 3.14545L8.45455 8.64517H7.05085L6.89744 3.14545H8.60412ZM7.7527 11.0997C7.49957 11.0997 7.28224 11.0102 7.10071 10.8312C6.91918 10.6497 6.82969 10.4324 6.83224 10.1793C6.82969 9.92869 6.91918 9.71392 7.10071 9.53494C7.28224 9.35597 7.49957 9.26648 7.7527 9.26648C7.9956 9.26648 8.20909 9.35597 8.39318 9.53494C8.57727 9.71392 8.6706 9.92869 8.67315 10.1793C8.6706 10.348 8.62585 10.5027 8.53892 10.6433C8.45455 10.7814 8.34332 10.8926 8.20526 10.977C8.06719 11.0588 7.91634 11.0997 7.7527 11.0997Z" fill="white"/>
  </svg>
  `
    : "";
};
// input-box

// messenger-box
const messengers = ref([
  {
    svg: `
      <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
        <g clip-path="url(#clip0_145_4898)">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M30.3616 0C38.1784 0 45.8323 3.09414 51.3692 8.79388C56.9061 14.3308 60.0002 21.8219 60.0002 29.8015C60.0002 46.2493 46.6465 59.7658 30.1987 59.7658C25.3132 59.7658 20.4277 58.6259 16.0308 56.1831L0.234375 60.2544L4.46847 44.7837C2.02572 40.2239 0.560075 35.1755 0.560075 29.9643C0.397225 13.5165 13.7509 0 30.3616 0Z" fill="#0DC143"/>
          <path d="M41.7649 35.2545L43.4134 36.0039C43.7131 36.1537 43.863 36.3036 43.863 36.3036V37.3526C43.7131 38.102 43.5632 38.8513 43.2635 39.4507C43.1136 39.7505 42.8139 40.0502 42.5142 40.3499C42.2145 40.6496 41.9147 40.7995 41.615 41.0992L41.3153 41.399C41.0155 41.6987 40.7158 41.6987 40.2662 41.9984C39.6668 42.2981 38.7676 42.5979 38.0183 42.5979H36.5196C36.07 42.448 35.4706 42.448 35.021 42.2981C30.9747 41.2491 27.3779 39.3009 24.2308 36.6033C23.9311 36.1537 23.4815 35.854 23.0319 35.4044L22.4324 34.805C20.0346 32.557 18.2362 30.0093 16.8875 27.1619L16.7376 26.7123C16.288 25.6633 15.9883 24.4643 15.9883 23.2654C15.9883 21.6169 16.5877 19.9684 17.6368 18.6197C17.9365 18.3199 18.0864 18.0202 18.3861 17.7205C18.6858 17.5706 18.9856 17.2709 19.2853 17.121L19.4352 16.9712C19.7349 16.9712 20.0346 16.8213 20.3343 16.8213H21.5332H21.9828C22.4324 16.9712 22.7322 17.121 23.0319 17.5706C23.4815 18.4698 25.2798 22.5161 25.4297 23.2654C25.5796 23.715 25.4297 24.3145 25.13 24.7641C24.8302 25.0638 24.6804 25.5134 24.3807 25.8131C23.9311 26.2627 23.3316 27.012 23.3316 27.012C23.1817 27.1619 23.1817 27.4616 23.1817 27.7614C23.3316 28.0611 23.3316 28.2109 23.4815 28.3608L23.6313 28.6605C24.3807 30.0093 25.4297 31.2082 26.4788 32.2573C26.7785 32.557 27.2281 32.8567 27.5278 33.1564C28.7267 34.3554 30.2254 35.2545 31.8739 36.0039L32.6232 36.3036C32.773 36.4535 33.0728 36.6033 33.2226 36.6033H33.3725C33.6722 36.6033 33.9719 36.4535 34.1218 36.1537C36.2199 33.7559 36.3698 33.606 36.3698 33.606C36.6695 33.4562 36.9692 33.3063 37.4188 33.3063C37.5687 33.3063 37.7185 33.4562 37.8684 33.4562C39.367 34.2055 41.7649 35.2545 41.7649 35.2545Z" fill="white"/>
        </g>
        <defs>
          <clipPath id="clip0_145_4898">
            <rect width="60" height="60" fill="white"/>
          </clipPath>
        </defs>
      </svg>
    `,
    active: true,
    name: "whatsapp",
  },

  {
    svg: `
      <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
        <g clip-path="url(#clip0_145_4899)">
          <path d="M30 60C46.5685 60 60 46.5685 60 30C60 13.4315 46.5685 0 30 0C13.4315 0 0 13.4315 0 30C0 46.5685 13.4315 60 30 60Z" fill="url(#paint0_linear_145_4899)"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M12.5876 30.6143C20.9907 26.5647 26.5942 23.8949 29.3979 22.605C37.403 18.9221 39.0664 18.2823 40.1505 18.2612C40.389 18.2566 40.9222 18.3219 41.2675 18.6319C41.5591 18.8936 41.6394 19.2472 41.6778 19.4954C41.7162 19.7435 41.764 20.3088 41.726 20.7505C41.2922 25.7922 39.4151 38.0268 38.4602 43.6736C38.0561 46.0629 37.2605 46.864 36.4903 46.9424C34.8163 47.1128 33.5452 45.7188 31.9239 44.5432C29.3869 42.7037 27.9536 41.5586 25.491 39.7636C22.6451 37.6891 24.49 36.549 26.1119 34.6856C26.5364 34.198 33.9118 26.7776 34.0545 26.1045C34.0724 26.0203 34.089 25.7065 33.9204 25.5408C33.7519 25.3751 33.5031 25.4317 33.3236 25.4768C33.0692 25.5407 29.0163 28.5038 21.1649 34.366C20.0145 35.2398 18.9725 35.6655 18.0389 35.6432C17.0097 35.6186 15.0299 34.9995 13.5581 34.4704C11.7529 33.8213 10.3182 33.4781 10.4431 32.3758C10.5082 31.8017 11.223 31.2145 12.5876 30.6143Z" fill="white"/>
        </g>
        <defs>
          <linearGradient id="paint0_linear_145_4899" x1="30" y1="0" x2="30" y2="59.555" gradientUnits="userSpaceOnUse">
            <stop stop-color="#2AABEE"/>
            <stop offset="1" stop-color="#229ED9"/>
          </linearGradient>
          <clipPath id="clip0_145_4899">
            <rect width="60" height="60" fill="white"/>
          </clipPath>
        </defs>
      </svg>
    `,
    active: false,
    name: "telegram",
  },

  {
    svg: `
      <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
        <g clip-path="url(#clip0_145_4900)">
          <path d="M35.8485 37.0248C35.8657 37.5147 35.8529 38.0855 35.9271 38.5042C36.3413 40.8592 39.0544 42.269 41.2058 41.23C41.4759 41.0992 41.7666 40.9047 42.0777 40.6465C44.2709 38.824 45.4874 35.8472 45.9159 33.0892C46.6702 28.2353 45.5121 22.7087 42.1226 19.0293C36.808 13.26 28.0657 12.1424 21.399 16.2285C16.7496 19.0787 14.0035 23.8458 13.7968 29.3079C13.405 39.6592 21.5473 46.9678 31.6994 46.0555C33.1256 45.9267 35.7091 45.5222 36.1196 43.8308C36.3833 42.7439 35.6664 41.5768 34.4822 41.681C34.3309 41.6944 34.0215 41.7853 33.5541 41.9536C32.1783 42.449 30.7523 42.6565 29.2762 42.5761C24.3818 42.3094 19.9668 39.4577 18.2125 34.8001C16.4986 30.2495 17.4784 24.818 20.8155 21.1993C27.1638 14.3169 40.0672 17.3424 42.2275 26.612C42.9713 29.8031 42.5256 33.618 40.9646 36.5296C40.7408 36.9461 40.5181 37.2775 40.2964 37.5237C39.8807 37.9858 39.1526 37.8315 38.9443 37.2795C38.8989 37.1581 38.8762 36.9346 38.8762 36.609C38.8782 32.4168 38.8777 28.225 38.8747 24.0338C38.8739 23.0667 38.7443 22.1918 37.7166 21.9663C36.7226 21.7476 35.9511 22.3274 35.9174 23.3649C35.9171 23.3712 35.915 23.3773 35.9113 23.3824C35.9076 23.3875 35.9025 23.3914 35.8966 23.3937C35.8907 23.3959 35.8842 23.3963 35.8781 23.395C35.8719 23.3936 35.8663 23.3904 35.8619 23.3858C32.9795 20.3753 28.596 19.5424 24.975 21.7903C21.975 23.6532 20.0859 27.0135 20.2297 30.5776C20.3953 34.6825 23.4724 38.5798 27.5054 39.5214C30.5481 40.2323 33.6125 39.2158 35.8035 37.0075C35.832 36.9791 35.847 36.9848 35.8485 37.0248Z" stroke="#8BC6F1" stroke-width="2"/>
          <path d="M24.4738 33.7857C25.6146 35.8764 27.8738 36.8502 30.1869 36.5513C32.1802 36.2943 33.7907 35.2075 34.7405 33.4644C36.3989 30.4217 35.536 25.9977 32.2012 24.4419C30.291 23.5505 27.691 23.5865 25.9779 24.949C23.4618 26.9513 22.9734 31.0352 24.4738 33.7857Z" stroke="#8BC6F1" stroke-width="2"/>
          <path d="M30.8911 59.9999H29.0963C22.3672 59.7402 16.4117 57.5447 11.2296 53.4134C5.67308 48.9827 1.82139 42.5355 0.522517 35.5243C-3.15014 15.695 13.3555 -1.95439 33.3382 0.244109C47.8873 1.84486 59.3465 14.0111 59.9495 28.707C60.6371 45.489 47.6431 59.4336 30.8911 59.9999ZM35.8476 37.0246C35.8648 37.5145 35.8521 38.0853 35.9263 38.504C36.3405 40.8591 39.0536 42.2688 41.2049 41.2299C41.4751 41.099 41.7657 40.9045 42.0768 40.6464C44.2701 38.8239 45.4866 35.8471 45.915 33.0891C46.6693 28.2351 45.5113 22.7085 42.1218 19.0291C36.8072 13.2598 28.0648 12.1422 21.3982 16.2284C16.7487 19.0786 14.0027 23.8456 13.7959 29.3078C13.4042 39.6591 21.5465 46.9677 31.6985 46.0553C33.1248 45.9265 35.7083 45.522 36.1188 43.8306C36.3824 42.7437 35.6656 41.5767 34.4813 41.6808C34.33 41.6943 34.0206 41.7852 33.5532 41.9535C32.1774 42.4489 30.7515 42.6563 29.2753 42.5759C24.3809 42.3093 19.966 39.4576 18.2117 34.7999C16.4978 30.2493 17.4776 24.8179 20.8147 21.1992C27.163 14.3168 40.0663 17.3422 42.2266 26.6119C42.9705 29.8029 42.5248 33.6179 40.9637 36.5295C40.74 36.946 40.5173 37.2773 40.2955 37.5235C39.8798 37.9857 39.1517 37.8314 38.9435 37.2793C38.898 37.158 38.8753 36.9345 38.8753 36.6089C38.8773 32.4166 38.8768 28.2249 38.8738 24.0336C38.8731 23.0666 38.7435 22.1917 37.7158 21.9662C36.7218 21.7475 35.9502 22.3273 35.9165 23.3647C35.9163 23.371 35.9142 23.3771 35.9105 23.3822C35.9068 23.3874 35.9016 23.3913 35.8957 23.3935C35.8898 23.3957 35.8834 23.3962 35.8772 23.3948C35.8711 23.3934 35.8655 23.3902 35.8611 23.3857C32.9787 20.3752 28.5952 19.5422 24.9742 21.7902C21.9742 23.6531 20.0851 27.0134 20.2289 30.5774C20.3944 34.6823 23.4716 38.5797 27.5045 39.5213C30.5472 40.2321 33.6117 39.2156 35.8027 37.0074C35.8311 36.9789 35.8461 36.9847 35.8476 37.0246Z" fill="#168DE2"/>
          <path d="M35.8035 37.0075C33.6125 39.2158 30.5481 40.2323 27.5054 39.5214C23.4724 38.5798 20.3953 34.6825 20.2297 30.5776C20.0859 27.0135 21.975 23.6532 24.975 21.7903C28.596 19.5424 32.9795 20.3753 35.8619 23.3858C35.8663 23.3904 35.8719 23.3936 35.8781 23.3949C35.8842 23.3963 35.8907 23.3959 35.8966 23.3937C35.9025 23.3914 35.9076 23.3875 35.9113 23.3824C35.915 23.3773 35.9171 23.3712 35.9174 23.3649C35.9511 22.3274 36.7226 21.7476 37.7166 21.9663C38.7443 22.1918 38.8739 23.0667 38.8747 24.0338C38.8777 28.225 38.8782 32.4168 38.8762 36.609C38.8762 36.9346 38.8989 37.1581 38.9443 37.2795C39.1526 37.8315 39.8807 37.9858 40.2964 37.5237C40.5181 37.2775 40.7408 36.9461 40.9646 36.5296C42.5256 33.618 42.9713 29.8031 42.2275 26.612C40.0672 17.3424 27.1638 14.3169 20.8155 21.1993C17.4784 24.818 16.4986 30.2495 18.2125 34.8001C19.9668 39.4577 24.3818 42.3094 29.2762 42.5761C30.7523 42.6565 32.1783 42.449 33.5541 41.9536C34.0215 41.7853 34.3309 41.6944 34.4822 41.681C35.6664 41.5768 36.3833 42.7439 36.1196 43.8308C35.7091 45.5222 33.1256 45.9267 31.6994 46.0555C21.5473 46.9678 13.405 39.6592 13.7968 29.3079C14.0035 23.8458 16.7496 19.0787 21.399 16.2285C28.0657 12.1424 36.808 13.26 42.1226 19.0293C45.5121 22.7087 46.6702 28.2353 45.9159 33.0892C45.4874 35.8472 44.2709 38.824 42.0777 40.6465C41.7666 40.9047 41.4759 41.0992 41.2058 41.23C39.0544 42.269 36.3413 40.8592 35.9271 38.5042C35.8529 38.0855 35.8657 37.5147 35.8485 37.0248C35.847 36.9848 35.832 36.9791 35.8035 37.0075ZM24.4739 33.7858C25.6147 35.8765 27.8739 36.8502 30.187 36.5514C32.1803 36.2944 33.7908 35.2075 34.7406 33.4645C36.399 30.4218 35.5361 25.9978 32.2013 24.442C30.2912 23.5506 27.6912 23.5866 25.978 24.9491C23.4619 26.9514 22.9736 31.0353 24.4739 33.7858Z" fill="white"/>
          <path d="M30.1869 36.5513C27.8738 36.8502 25.6146 35.8764 24.4738 33.7857C22.9734 31.0352 23.4618 26.9513 25.9779 24.949C27.691 23.5865 30.291 23.5505 32.2012 24.4419C35.536 25.9977 36.3989 30.4217 34.7405 33.4644C33.7907 35.2075 32.1802 36.2943 30.1869 36.5513Z" fill="#168DE2"/>
        </g>
      <defs>
        <clipPath id="clip0_145_4900">
          <rect width="60" height="60" fill="white"/>
        </clipPath>
      </defs>
      </svg>
    `,
    active: false,
    name: mailText,
  },
]);

const setMessenger = (i: number) => {
  messengers.value.forEach((element, index) => {
    index == i ? (element.active = true) : (element.active = false);
  });
};
// messenger-box

//resume-box
const fileName = ref("Прикрепить файл");
const onFileChange = (e: any) => {
  if (!!e.target.files[0]) {
    fileName.value = e.target.files[0].name;
  } else {
    fileName.value = "Прикрепить файл";
  }
};
// //resume-box
const validateSubmit = async () => {
  if (
    name.value.length < 2 ||
    phone.value.length < 18 ||
    (email.value.length < 8 &&
      messengers.value.find((el) => el.name == mailText)!.active)
  ) {
    errorSubmit.value = true;
    setTimeout(() => {
      errorSubmit.value = false;
    }, 6000);
  } else {
    handleSubmit();
  }
};

const handleSubmit = async () => {
  loading.value = true;
  try {
    // const response = await fetch("http://localhost:1234/enter", {
    //   method: "POST",
    //   headers: {
    //     "Content-Type": "application/json",
    //   },
    //   body: JSON.stringify({
    //     Password: storeClient.client.Password,
    //     Telephone: storeClient.client.Telephone,
    //   }),
    // });
  } catch (err) {
    console.log(err);
  } finally {
    setTimeout(() => {
      loading.value = false;
    }, 1000);
  }
};
</script>

<style lang="scss">
#form-modal {
  .form-modal {
    &__subtitle {
      font-size: 20px;
      font-weight: 500;
      line-height: 24.26px;
      color: rgba(50, 50, 50, 1);
      text-align: center;
      margin-bottom: 20px;
    }
  }

  .input-box {
    display: grid;
    grid-template-columns: repeat(2, 1fr);
    gap: 20px;
    margin-bottom: 30px;

    @media (max-width: 768px) {
      grid-template-columns: 1fr;
      gap: 10px;
    }

    .input-container {
      border: 2px solid rgba(219, 219, 219, 1);
      border-radius: 5px;
      padding: 10px 30px;
      transition: all 0.2s;
      position: relative;

      .error-icon {
        position: absolute;
        right: 15px;
        top: 50%;
        transform: translateY(-50%);
      }

      &-error {
        border: 2px solid rgba(255, 0, 0, 1);
      }

      input {
        &,
        &::placeholder {
          font-family: "Gilroy";
          font-size: 18px;
          font-weight: 400;
          line-height: 25px;
          color: rgba(50, 50, 50, 1);
        }
      }
    }
  }

  .messenger-box {
    display: flex;
    align-items: center;
    justify-content: center;
    gap: 20px;
    margin-bottom: 30px;

    .messenger-box__item {
      transition: all 0.2s;
      cursor: pointer;
      opacity: 0.4;

      &:hover {
        opacity: 0.7;
      }

      &-active {
        opacity: 1;
      }
    }
  }

  .resume-box {
    margin-bottom: 30px;
    position: relative;
    display: flex;
    align-items: center;
    gap: 5px;
    justify-content: center;

    p {
      font-size: 18px;
      font-weight: 500;
      line-height: 25px;
      color: rgba(50, 50, 50, 1);
    }

    .file-input {
      position: absolute;
      width: 100%;
      height: 100%;
      opacity: 0;
      top: 0;
      left: 0;
      cursor: pointer;
    }
  }

  .button-primary {
    margin: 0 auto 20px;
  }

  .policy {
    font-size: 18px;
    font-weight: 300;
    line-height: 25px;
    color: rgba(104, 104, 104, 1);
    text-align: center;

    @media (max-width: 768px) {
      font-size: 14px;
      line-height: 25px;
    }

    a {
      text-decoration: underline;
      color: rgba(104, 104, 104, 1);
    }
  }
}
</style>
