import{d as r,o as s,a as l,F as h,r as u,b as e,t as d,e as m,f as g,g as o,w as f,u as w,_ as H}from"./Cty0C-0p.js";import{_ as V}from"./rNyma0sg.js";import{_ as x}from"./DN8ainW5.js";import{P as v}from"./sElPefyt.js";import"./BHrUaapQ.js";import"./CaKdiuIV.js";const y={class:"contact-wrapper__side"},M=["innerHTML"],b=["textContent"],Z=["textContent"],k=r({__name:"Side",setup(p){const a=[{svg:`
    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
        <g clip-path="url(#clip0_216_1746)">
            <path d="M29.1211 19.5032H22.8456V15.7695C22.8456 15.4454 22.6671 15.1476 22.3814 14.9947C22.0956 14.8418 21.7488 14.8585 21.479 15.0384L15.8162 18.8145V15.7695C15.8162 15.4454 15.6379 15.1476 15.352 14.9947C15.0661 14.8416 14.7194 14.8585 14.4498 15.0384L8.787 18.8145V15.7695C8.787 15.4481 8.61168 15.1524 8.32947 14.9984C8.04749 14.8441 7.70393 14.8562 7.4334 15.03L0.404205 19.5421C0.152206 19.704 0 19.9827 0 20.2819V29.1124C0 29.5978 0.393448 29.9913 0.878906 29.9913H22.871V26.4429C22.871 25.9577 23.2647 25.564 23.7499 25.564C24.2354 25.564 24.6288 25.9577 24.6288 26.4429V29.9913H29.1211C29.6066 29.9913 30 29.5978 30 29.1124V20.3821C30 19.8969 29.6066 19.5032 29.1211 19.5032ZM7.0182 25.5929C7.0182 26.0783 6.62476 26.4718 6.1393 26.4718C5.65407 26.4718 5.26039 26.0783 5.26039 25.5929V24.714C5.26039 24.2287 5.65407 23.835 6.1393 23.835C6.62476 23.835 7.0182 24.2287 7.0182 24.714V25.5929ZM10.5338 25.5929C10.5338 26.0783 10.1404 26.4718 9.65492 26.4718C9.16969 26.4718 8.77602 26.0783 8.77602 25.5929V24.714C8.77602 24.2287 9.16969 23.835 9.65492 23.835C10.1404 23.835 10.5338 24.2287 10.5338 24.714V25.5929ZM14.0495 25.5929C14.0495 26.0783 13.656 26.4718 13.1705 26.4718C12.6851 26.4718 12.2916 26.0783 12.2916 25.5929V24.714C12.2916 24.2287 12.6851 23.835 13.1705 23.835C13.656 23.835 14.0495 24.2287 14.0495 24.714V25.5929ZM17.5889 25.5929C17.5889 26.0783 17.1954 26.4718 16.71 26.4718C16.2245 26.4718 15.8311 26.0783 15.8311 25.5929V24.714C15.8311 24.2287 16.2245 23.835 16.71 23.835C17.1954 23.835 17.5889 24.2287 17.5889 24.714V25.5929Z" fill="#004978"/>
            <path d="M26.7133 8.77922L26.2182 0.824203C26.1894 0.360947 25.8053 0 25.3409 0H20.3604C19.8963 0 19.5122 0.360947 19.4834 0.824203L18.9883 8.77922H26.7133Z" fill="#004978"/>
            <path d="M18.8791 10.5352L18.6113 14.8386L20.5037 13.5765C20.9384 13.287 21.444 13.1339 21.9663 13.1339C22.3986 13.1339 22.8287 13.2417 23.2103 13.4458C24.0692 13.9054 24.603 14.7962 24.603 15.7706V17.7465H27.2718L26.8229 10.5354H18.8791V10.5352Z" fill="#004978"/>
            <path d="M15.6934 6.15234H8.66211C8.17665 6.15234 7.7832 5.7589 7.7832 5.27344C7.7832 4.78798 8.17665 4.39453 8.66211 4.39453H15.6934C16.1788 4.39453 16.5723 4.78798 16.5723 5.27344C16.5723 5.7589 16.1788 6.15234 15.6934 6.15234Z" fill="#004978"/>
            <path d="M6.27344 9.66797H3.92969C3.44446 9.66797 3.05078 9.27452 3.05078 8.78906C3.05078 8.3036 3.44446 7.91016 3.92969 7.91016H6.27344C6.7589 7.91016 7.15234 8.3036 7.15234 8.78906C7.15234 9.27452 6.7589 9.66797 6.27344 9.66797Z" fill="#004978"/>
        </g>
        <defs>
            <clipPath id="clip0_216_1746">
                <rect width="30" height="30" fill="white"/>
            </clipPath>
        </defs>
    </svg>
    `,title:"Производство и офис",description:[{subitle:"Адрес:",text:"г. Киров, Октябрьский пр-т, д. 24Д"},{subitle:"Адрес (для почты):",text:"610000, а/я 158"}]},{svg:`
    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
        <g clip-path="url(#clip0_216_1738)">
            <path d="M27.9565 19.9494C26.4326 18.7248 25.0347 18.1294 23.6828 18.1294C21.7273 18.1294 20.3193 19.3734 19.0445 20.6477C18.8979 20.7944 18.7204 20.8628 18.486 20.8628C17.4118 20.8629 15.522 19.5177 12.8692 16.8645C9.74826 13.7434 8.56829 11.7583 9.36173 10.9646C11.5126 8.81439 12.1841 6.65888 8.89093 2.56327C7.712 1.09595 6.55855 0.382812 5.36469 0.382812C3.75463 0.382812 2.5307 1.66981 1.45086 2.80541C1.26417 3.0017 1.08782 3.18714 0.914908 3.36005C-0.305578 4.58043 -0.304952 7.24234 0.916683 10.481C2.25704 14.0345 4.90349 17.9001 8.36865 21.3658C11.0484 24.0454 13.9642 26.2109 16.8009 27.6648C19.2774 28.9343 21.6797 29.6144 23.5651 29.6144C23.5653 29.6144 23.5655 29.6144 23.5658 29.6144C24.7457 29.6144 25.7041 29.3571 26.337 28.8336C27.6228 27.7706 30.0159 25.8016 29.9999 23.4627C29.9912 22.2083 29.3038 21.0327 27.9565 19.9494Z" fill="#004978"/>
        </g>
        <defs>
            <clipPath id="clip0_216_1738">
                <rect width="30" height="30" fill="white"/>
            </clipPath>
        </defs>
    </svg>
    `,title:"Колл-центр",description:[{subitle:"Телефон:",text:"+7 (922) 665-24-91"},{subitle:"E-mail:",text:"op@gradushaus.ru"}]},{svg:`
    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
        <g clip-path="url(#clip0_216_1774)">
            <path d="M26.25 4.6875H20.625V2.8125C20.625 1.77657 19.7859 0.9375 18.75 0.9375H11.25C10.2141 0.9375 9.375 1.7775 9.375 2.8125V4.6875H3.75C1.67907 4.6875 0 6.36657 0 8.4375V13.125H30V8.4375C30 6.36657 28.3209 4.6875 26.25 4.6875ZM18.75 4.6875H11.25V3.75C11.25 3.2325 11.67 2.8125 12.1875 2.8125H17.8125C18.33 2.8125 18.75 3.2325 18.75 3.75V4.6875ZM18.75 15.9375C18.75 18.0084 17.0709 19.6875 15 19.6875C12.9291 19.6875 11.25 18.0084 11.25 15.9375C11.25 15.6113 11.3006 15.2991 11.3822 15H0V25.3125C0 27.3834 1.67907 29.0625 3.75 29.0625H26.25C28.3209 29.0625 30 27.3834 30 25.3125V15H18.6178C18.6994 15.3 18.75 15.6113 18.75 15.9375ZM16.875 15.9375C16.875 15.5944 16.7756 15.2766 16.6153 15H13.3856C13.2244 15.2766 13.125 15.5944 13.125 15.9375C13.125 16.9734 13.9641 17.8125 15 17.8125C16.0359 17.8125 16.875 16.9734 16.875 15.9375Z" fill="#004978"/>
        </g>
        <defs>
            <clipPath id="clip0_216_1774">
                <rect width="30" height="30" fill="white"/>
            </clipPath>
        </defs>
    </svg>   
    `,title:"Отдел подбора персонала",description:[{subitle:"Телефон:",text:"+7 (922) 995-12-46"},{subitle:"E-mail:",text:"resume@pro-torg.com"}]},{svg:`
    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
        <g clip-path="url(#clip0_216_1758)">
            <path d="M11.2506 21.0078C10.0102 21.0078 9.00195 22.0161 9.00195 23.2564C9.00195 24.4967 10.0102 25.505 11.2506 25.505C12.4909 25.505 13.4992 24.4967 13.4992 23.2564C13.5072 22.0161 12.4989 21.0078 11.2506 21.0078Z" fill="#004978"/>
            <path d="M25.5108 7.5008H21.0056V4.5H4.5052V7.5008H1.5044C0.920245 8.08496 0.592158 8.41304 0 9.0052C0.584156 9.58936 0.912243 9.91745 1.5044 10.5096H4.5052V13.5104H3.0008C2.41664 14.0946 2.08856 14.4226 1.4964 15.0148C2.08055 15.599 2.40864 15.927 3.0008 16.5112H4.5052V22.5048H7.57802C7.92211 20.7923 9.44252 19.504 11.251 19.504C13.0675 19.504 14.5799 20.7923 14.924 22.5048H21.0776C21.4217 20.7923 22.9421 19.504 24.7506 19.504C26.5671 19.504 28.0795 20.7923 28.4236 22.5048H30V12.006C30.008 9.52534 27.9995 7.5008 25.5108 7.5008ZM27.0072 15.0068H22.502V10.5096H25.5028C26.327 10.5096 27.0072 11.1818 27.0072 12.006V15.0068Z" fill="#004978"/>
            <path d="M24.7584 21.0078C23.518 21.0078 22.5098 22.0161 22.5098 23.2564C22.5098 24.4967 23.518 25.505 24.7584 25.505C25.9987 25.505 27.007 24.4967 27.007 23.2564C27.007 22.0161 25.9987 21.0078 24.7584 21.0078Z" fill="#004978"/>
        </g>
        <defs>
            <clipPath id="clip0_216_1758">
                <rect width="30" height="30" fill="white"/>
            </clipPath>
        </defs>
    </svg>
    `,title:"Оптовый отдел",description:[{subitle:"Телефон:",text:"+7 (495) 255-37-40"},{subitle:"E-mail:",text:"opt@helicon-prom.ru"}]}];return(i,t)=>(s(),l("div",y,[(s(),l(h,null,u(a,(n,C)=>e("div",{key:C,class:"contact-item"},[e("div",{innerHTML:n.svg},null,8,M),e("h2",{textContent:d(n.title)},null,8,b),(s(!0),l(h,null,u(n.description,(c,_)=>(s(),l("p",{class:"contact-item__text",key:_},[m(d(c.subitle)+" ",1),e("span",{textContent:d(c.text)},null,8,Z)]))),128))])),64))]))}}),P={class:"contact-map skeleton-image"},L=r({__name:"Map",setup(p){async function a(){try{let i=document.createElement("script");i.setAttribute("async",""),i.type="text/javascript",i.src="https://api-maps.yandex.ru/2.1/?lang=ru_RU",document.querySelector("body").appendChild(i),i.onload=function(){ymaps.ready(function(){let t=new ymaps.Map("my-map",{center:[58.629283,49.648934],zoom:17,controls:["zoomControl"]});t.behaviors.disable("scrollZoom");let n=new ymaps.Placemark([58.629283,49.648914],{hasHint:!0,hintContent:"Офис"},{iconLayout:"default#image",iconImageHref:"map-icon.svg",iconImageSize:[48,65],iconImageOffset:[-8,-48]});t.geoObjects.add(n)})}}catch{}}return g(()=>{a()}),(i,t)=>(s(),l("section",P,t[0]||(t[0]=[e("div",{id:"my-map"},null,-1)])))}}),$={class:"contact-gallery"},B=["modules"],E={class:"gallery-item__img"},z=r({__name:"Gallery",setup(p){const a=[{src:"workspace-1",alt:"текст"},{src:"workspace-2",alt:"текст"},{src:"workspace-3",alt:"текст"}];return(i,t)=>{const n=H,C=x;return s(),l("section",$,[o(C,null,{default:f(()=>[e("swiper-container",{loop:!0,"slides-per-view":1,"space-between":30,breakpoints:{992:{slidesPerView:2}},pagination:{el:".gallery-pagination",type:"bullets",clickable:!0},modules:[w(v)],class:"contact-gallery-swiper"},[(s(),l(h,null,u(a,(c,_)=>e("swiper-slide",{key:_,class:"gallery-item"},[e("div",E,[o(n,{format:"avif,webp",sizes:"600px",src:"/images/workspace/"+c.src+".png",alt:c.alt},null,8,["src","alt"])])])),64))],8,B)]),_:1}),t[0]||(t[0]=e("div",{class:"gallery-pagination"},null,-1))])}}}),N={class:"contact-page page"},S={class:"container"},I={class:"contact-wrapper"},D=r({__name:"index",setup(p){const a=[{title:"Главная",ref:"/"},{title:"Контакты"}];return(i,t)=>(s(),l("main",N,[e("div",S,[o(V,{array:a}),t[0]||(t[0]=e("h1",{class:"page-title"},"Контакты",-1)),e("div",I,[o(k),o(L),o(z)])])]))}});export{D as default};
